tap "charmbracelet/tap"
tap "common-fate/granted"
tap "derailed/k9s"
tap "ggerganov/ggerganov"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "spotify/public"
tap "telepresenceio/telepresence"
tap "twilio-internal/tap", "git@github.com:twilio-internal/homebrew-tap.git"
# C parser in Python
brew "pycparser"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Core application library for C
brew "glib"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", args: ["HEAD"]
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Tool for managing the macOS Dock
brew "dockutil"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Modern replacement for 'ls'
brew "exa"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
brew "fd"
  brew "ripgrep"       # Better grep
# Popular GNU data compression program
brew "gzip"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Pager program similar to more
brew "less"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility to list open files
brew "lsof"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Modern Python package installer and resolver
brew "uv"
# File browser
brew "ranger"
# Utility that provides fast incremental file transfer
brew "rsync"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# File synchronization tool
brew "unison"
# Vi 'workalike' with many additional features
brew "vim"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Local dev environment attached to a remote Kubernetes cluster
brew "telepresenceio/telepresence/telepresence-oss"
# A CLI for bundle build management for Kubernetes platform at Twilio
brew "twilio-internal/tap/bundlectl"
# A kubectl plugin for working with OTK clusters
brew "twilio-internal/tap/kubectl-otk"
# GPU-accelerated terminal emulator
cask "alacritty", args: { appdir: "/Applications" }
# Application launcher and productivity software
cask "alfred", args: { appdir: "/Applications" }
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki", args: { appdir: "/Applications" }
# Application uninstaller
cask "appcleaner", args: { appdir: "/Applications" }
# Desktop password and login vault
cask "bitwarden", args: { appdir: "/Applications" }
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn", args: { appdir: "/Applications" }
# E-books management software
cask "calibre", args: { appdir: "/Applications" }
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community", args: { appdir: "/Applications" }
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to hide status bar icons
cask "dozer", args: { appdir: "/Applications" }
# Collaborative team software
cask "figma", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Web browser
cask "firefox@developer-edition"
# Screen colour temperature controller
cask "flux-app", args: { appdir: "/Applications" }
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code", args: { appdir: "/Applications" }
cask "font-cascadia-code-pl", args: { appdir: "/Applications" }
cask "font-cascadia-mono", args: { appdir: "/Applications" }
cask "font-cascadia-mono-pl", args: { appdir: "/Applications" }
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-computer-modern", args: { appdir: "/Applications" }
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-fira-code-nerd-font"
cask "font-fira-mono", args: { appdir: "/Applications" }
cask "font-fira-mono-nerd-font"
cask "font-fira-sans", args: { appdir: "/Applications" }
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono", args: { appdir: "/Applications" }
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono", args: { appdir: "/Applications" }
cask "font-victor-mono-nerd-font"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp", args: { appdir: "/Applications" }
# Utility to provide quick look previews for files that aren't natively supported
cask "glance", args: { appdir: "/Applications" }
# Desktop automation application
cask "hammerspoon", args: { appdir: "/Applications" }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# JetBrains tools manager
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
# Keyboard customiser
cask "karabiner-elements", args: { appdir: "/Applications" }
# Interface for reading and syncing eBooks
cask "kindle", args: { appdir: "/Applications" }
# Discover, download, and run local LLMs
cask "lm-studio"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Cross-platform text expander
cask "espanso"
# Clipboard manager
cask "maccy", args: { appdir: "/Applications" }
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok", args: { appdir: "/Applications" }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian", args: { appdir: "/Applications" }
# Image editor
cask "paintbrush", args: { appdir: "/Applications" }
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications" }
# Quick Look plugin for subtitle (.srt) files
cask "qladdict", args: { appdir: "/Applications" }
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize", args: { appdir: "/Applications" }
# Quick Look plugin for Kindle ebook formats
cask "qlmobi", args: { appdir: "/Applications" }
# Quick Look plugin to view patch files
cask "qlprettypatch", args: { appdir: "/Applications" }
# Quick Look plugin for plaintext files without an extension
cask "qlstephen", args: { appdir: "/Applications" }
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo", args: { appdir: "/Applications" }
# Quick Look plugin for CSV files
cask "quicklook-csv", args: { appdir: "/Applications" }
# Quick Look plugin for viewing NFO files
cask "quicknfo", args: { appdir: "/Applications" }
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Create and run scripts
cask "script-kit"
# Block your own access to distracting websites
cask "selfcontrol"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
cask "suspicious-package", args: { appdir: "/Applications" }
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# File transfer application
cask "transmit", args: { appdir: "/Applications" }
# GUI for the Neovim text editor
cask "vimr", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc", args: { appdir: "/Applications" }
# Network protocol analyzer
cask "wireshark-app"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "DigiDoc4", id: 1370791134
mas "Okta Verify", id: 490179405
mas "Perplexity", id: 6714467650
mas "Raycast Companion", id: 6738274497
mas "TeRa", id: 1243347809
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-speech"
vscode "oxc.oxc-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wesbos.theme-cobalt2"
